Revit 2024 API
PolylineNode.GetPolyline Method
 Returns the polyline object corresponding to the node.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public PolyLine GetPolyline()
Visual Basic
Public Function GetPolyline As PolyLine
Visual C++
public:
PolyLine^ GetPolyline()
Return Value
 The polyline instance.
See Also
PolylineNode Class
Autodesk.Revit.DB Namespace